Thank you ! yes token at povider worked!. Know i have this other error:

mian.tf ->

module "network" {
  source = "cktf/network/hcloud"

  name = "zpot-net"
  cidr = "10.0.0.0/16"
  subnets = {
    masters = {
      type = "server",
      cidr = "10.0.0.0/24"
    }
    workers = {
      type = "server",
      cidr = "10.0.1.0/24"
    }
  }
}

module "rke" {
  source = "cktf/rke/hcloud"

  name         = "rke2-zpot"
  network_id   = module.network.network_id
  hcloud_token = "Ao...........................................................................................................................5dY"

  masters = {
    1 = {
      type     = "cx21"
      location = "fsn1"
      tags     = {}
    }
    2 = {
      type     = "cx21"
      location = "fsn1"
      tags     = {}
    }
    3 = {
      type     = "cx21"
      location = "fsn1"
      tags     = {}
    }
  }
  node_pools = {
    pool1 = {
      type     = "cx11"
      location = "fsn1"
      min_size = 2
      max_size = 2
    }
  }
}


terraform {
  required_version = ">= 0.14.0"
  required_providers {
    tls = {
      source  = "hashicorp/tls"
      version = ">= 3.0.0"
    }
    random = {
      source  = "hashicorp/random"
      version = ">= 3.0.0"
    }
    hcloud = {
      source  = "hetznercloud/hcloud"
      version = ">= 1.31.0"
    }
    k8sbootstrap = {
      source  = "nimbolus/k8sbootstrap"
      version = ">= 0.1.2"
    }
    helm = {
      source  = "hashicorp/helm"
      version = ">= 2.0.0"
    }
  }
}

variable "hcloud_token" {}

provider "hcloud" {
  token = var.hcloud_token
}


run terraform -> and get this error

$ terraform apply
var.hcloud_token
  Enter a value: Aoi........................................................................................................................5dY


Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.network.hcloud_network.this will be created
  + resource "hcloud_network" "this" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "10.0.0.0/16"
      + name              = "zpot-net"
    }

  # module.network.hcloud_network_subnet.this["masters"] will be created
  + resource "hcloud_network_subnet" "this" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.0.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "server"
    }

  # module.network.hcloud_network_subnet.this["workers"] will be created
  + resource "hcloud_network_subnet" "this" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.1.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "server"
    }

  # module.rke.data.k8sbootstrap_auth.this will be read during apply
  # (config refers to values not yet known)
 <= data "k8sbootstrap_auth" "this" {
      + ca_crt     = (known after apply)
      + id         = (known after apply)
      + kubeconfig = (sensitive value)
      + server     = (known after apply)
      + token      = (sensitive value)
    }

  # module.rke.hcloud_firewall.this will be created
  + resource "hcloud_firewall" "this" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "rke2-zpot"

      + apply_to {
          + label_selector = "hcloud/node-group=rke2-zpot-pool1"
          + server         = (known after apply)
        }
      + apply_to {
          + label_selector = (known after apply)
          + server         = (known after apply)
        }
      + apply_to {
          + label_selector = (known after apply)
          + server         = (known after apply)
        }
      + apply_to {
          + label_selector = (known after apply)
          + server         = (known after apply)
        }

      + rule {
          + description     = "ICMP Internet Traffic"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + protocol        = "icmp"
          + source_ips      = []
        }
      + rule {
          + description     = "TCP Internet Traffic"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + description     = "UDP Internet Traffic"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = []
        }
    }

  # module.rke.hcloud_load_balancer.this will be created
  + resource "hcloud_load_balancer" "this" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = (known after apply)
      + name               = "rke2-zpot"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = "eu-central"

      + algorithm {
          + type = "round_robin"
        }

      + target {
          + server_id      = (known after apply)
          + type           = (known after apply)
          + use_private_ip = (known after apply)
        }
    }

  # module.rke.hcloud_load_balancer_network.this will be created
  + resource "hcloud_load_balancer_network" "this" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + network_id              = (known after apply)
    }

  # module.rke.hcloud_load_balancer_service.this will be created
  + resource "hcloud_load_balancer_service" "this" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check {
          + interval = (known after apply)
          + port     = (known after apply)
          + protocol = (known after apply)
          + retries  = (known after apply)
          + timeout  = (known after apply)

          + http {
              + domain       = (known after apply)
              + path         = (known after apply)
              + response     = (known after apply)
              + status_codes = (known after apply)
              + tls          = (known after apply)
            }
        }

      + http {
          + certificates    = (known after apply)
          + cookie_lifetime = (known after apply)
          + cookie_name     = (known after apply)
          + redirect_http   = (known after apply)
          + sticky_sessions = (known after apply)
        }
    }

  # module.rke.hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "hcloud/master=rke2-zpot"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # module.rke.hcloud_placement_group.this will be created
  + resource "hcloud_placement_group" "this" {
      + id      = (known after apply)
      + name    = "rke2-zpot"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.rke.hcloud_server.this["1"] will be created
  + resource "hcloud_server" "this" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "hcloud/master" = "rke2-zpot"
        }
      + location                   = "fsn1"
      + name                       = "rke2-zpot-master-1"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx21"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)
    }

  # module.rke.hcloud_server.this["2"] will be created
  + resource "hcloud_server" "this" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "hcloud/master" = "rke2-zpot"
        }
      + location                   = "fsn1"
      + name                       = "rke2-zpot-master-2"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx21"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)
    }

  # module.rke.hcloud_server.this["3"] will be created
  + resource "hcloud_server" "this" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "hcloud/master" = "rke2-zpot"
        }
      + location                   = "fsn1"
      + name                       = "rke2-zpot-master-3"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx21"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)
    }

  # module.rke.hcloud_server_network.this["1"] will be created
  + resource "hcloud_server_network" "this" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.rke.hcloud_server_network.this["2"] will be created
  + resource "hcloud_server_network" "this" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.rke.hcloud_server_network.this["3"] will be created
  + resource "hcloud_server_network" "this" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.rke.hcloud_ssh_key.this will be created
  + resource "hcloud_ssh_key" "this" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "rke2-zpot"
      + public_key  = (known after apply)
    }

  # module.rke.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "9.21.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.rke.random_string.agent_token will be created
  + resource "random_string" "agent_token" {
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.rke.random_string.cluster_token will be created
  + resource "random_string" "cluster_token" {
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.rke.random_string.token_id will be created
  + resource "random_string" "token_id" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.rke.random_string.token_secret will be created
  + resource "random_string" "token_secret" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.rke.tls_private_key.this will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.rke.tls_private_key.this: Creating...
module.rke.random_string.agent_token: Creating...
module.rke.random_string.token_id: Creating...
module.rke.random_string.cluster_token: Creating...
module.rke.random_string.token_id: Creation complete after 0s [id=qprwgf]
module.rke.random_string.token_secret: Creating...
module.network.hcloud_network.this: Creating...
module.rke.hcloud_load_balancer.this: Creating...
module.rke.hcloud_placement_group.this: Creating...
module.rke.random_string.token_secret: Creation complete after 0s [id=e395303r5xqjcq2v]
module.rke.random_string.agent_token: Creation complete after 0s [id=xLxsYdPxaRimI2PLYGFn6vGv8KBVMbvdphWhoXEOz9Edm5gD]
module.rke.random_string.cluster_token: Creation complete after 0s [id=9W3vUroafhaszHYYVEYaSHkHbeYvhCPMgHuc9197PjAY9UBh]
module.network.hcloud_network.this: Creation complete after 1s [id=2238879]
module.network.hcloud_network_subnet.this["workers"]: Creating...
module.network.hcloud_network_subnet.this["masters"]: Creating...
module.rke.hcloud_placement_group.this: Creation complete after 1s [id=98171]
module.rke.tls_private_key.this: Creation complete after 2s [id=01b8e75cbc054e91aed970a2e491653ed082041a]
module.rke.hcloud_ssh_key.this: Creating...
module.rke.hcloud_ssh_key.this: Creation complete after 1s [id=9083149]
module.rke.hcloud_load_balancer.this: Creation complete after 3s [id=958222]
module.rke.hcloud_load_balancer_service.this: Creating...
module.network.hcloud_network_subnet.this["masters"]: Creation complete after 2s [id=2238879-10.0.0.0/24]
module.network.hcloud_network_subnet.this["workers"]: Creation complete after 2s [id=2238879-10.0.1.0/24]
module.rke.hcloud_load_balancer_network.this: Creating...
module.rke.hcloud_load_balancer_service.this: Creation complete after 1s [id=958222__6443]
module.rke.hcloud_load_balancer_network.this: Creation complete after 3s [id=958222-2238879]
module.rke.hcloud_load_balancer_target.this: Creating...
module.rke.hcloud_server.this["2"]: Creating...
module.rke.hcloud_server.this["1"]: Creating...
module.rke.hcloud_server.this["3"]: Creating...
module.rke.helm_release.this: Creating...
module.rke.hcloud_load_balancer_target.this: Creation complete after 3s [id=lb-label-selector-tgt-fd13b5a9ab16eb66def9c705c073dc82a4f44e79005af5dc5082fc2d7bd2620e-958222]
module.rke.hcloud_server.this["3"]: Creation complete after 9s [id=25917223]
module.rke.hcloud_server.this["2"]: Still creating... [10s elapsed]
module.rke.hcloud_server.this["1"]: Still creating... [10s elapsed]
module.rke.hcloud_server.this["1"]: Creation complete after 10s [id=25917224]
module.rke.hcloud_server.this["2"]: Creation complete after 11s [id=25917225]
module.rke.hcloud_server_network.this["1"]: Creating...
module.rke.hcloud_server_network.this["3"]: Creating...
module.rke.data.k8sbootstrap_auth.this: Reading...
module.rke.hcloud_server_network.this["2"]: Creating...
module.rke.hcloud_firewall.this: Creating...
module.rke.hcloud_server_network.this["3"]: Creation complete after 5s [id=25917223-2238879]
module.rke.hcloud_server_network.this["1"]: Creation complete after 7s [id=25917224-2238879]
module.rke.data.k8sbootstrap_auth.this: Still reading... [10s elapsed]
module.rke.hcloud_server_network.this["2"]: Still creating... [10s elapsed]
module.rke.hcloud_firewall.this: Still creating... [10s elapsed]
module.rke.hcloud_server_network.this["2"]: Creation complete after 13s [id=25917225-2238879]
module.rke.hcloud_firewall.this: Creation complete after 17s [id=611785]
module.rke.data.k8sbootstrap_auth.this: Still reading... [20s elapsed]
module.rke.data.k8sbootstrap_auth.this: Still reading... [30s elapsed]
module.rke.data.k8sbootstrap_auth.this: Still reading... [40s elapsed]
module.rke.data.k8sbootstrap_auth.this: Still reading... [50s elapsed]
module.rke.data.k8sbootstrap_auth.this: Still reading... [1m0s elapsed]
module.rke.data.k8sbootstrap_auth.this: Still reading... [1m10s elapsed]
module.rke.data.k8sbootstrap_auth.this: Read complete after 1m20s [id=bootstrap-token]
╷
│ Error: Kubernetes cluster unreachable: invalid configuration: no configuration has been provided, try setting KUBERNETES_MASTER environment variable
│ 
│   with module.rke.helm_release.this,
│   on .terraform/modules/rke/node_pools.tf line 1, in resource "helm_release" "this":
│    1: resource "helm_release" "this" {



Again Many Thanks for any advice on this error !
